{"class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"target_shape": [1, 32, 32], "batch_input_shape": [null, 32, 32], "name": "reshape_1", "input_dtype": "float32", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "bias": true, "W_regularizer": null, "nb_filter": 32, "nb_col": 3, "init": "glorot_uniform", "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 3, "name": "convolution2d_1", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "bias": true, "W_regularizer": null, "nb_filter": 32, "nb_col": 3, "init": "glorot_uniform", "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 3, "name": "convolution2d_2", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "bias": true, "W_regularizer": null, "nb_filter": 16, "nb_col": 3, "init": "glorot_uniform", "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 3, "name": "convolution2d_3", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "bias": true, "W_regularizer": null, "nb_filter": 16, "nb_col": 3, "init": "glorot_uniform", "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 3, "name": "convolution2d_4", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "input_dim": 400, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_1", "W_constraint": null, "output_dim": 128, "activation": "relu", "activity_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "input_dim": 128, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "name": "dense_2", "W_constraint": null, "output_dim": 2, "activation": "softmax", "activity_regularizer": null, "trainable": true}}], "keras_version": "1.2.2"}