{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [1, 32, 32], "batch_input_shape": [null, 32, 32], "trainable": true, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_1", "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "th", "nb_col": 3, "trainable": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_2", "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "th", "nb_col": 3, "trainable": true, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_3", "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "th", "nb_col": 3, "trainable": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_4", "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "th", "nb_col": 3, "trainable": true, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "init": "glorot_uniform", "activation": "relu", "input_dim": 800, "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 128, "trainable": true, "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "init": "glorot_uniform", "activation": "softmax", "input_dim": 128, "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 2, "trainable": true, "W_constraint": null}}]}